Revit 2027 API
ColorFillSchemeEntry.GetIntegerValue Method
 Gets the Integer value stored within the entry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetIntegerValue()
Public Function GetIntegerValue As Integer
public:
int GetIntegerValue()
member GetIntegerValue : unit -> int
Return Value
Int32
 The Integer value contained in the entry.
Remarks
 This method should only be used if the StorageType property reports the type of the entry as a Integer.
See Also
Reference
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace